program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3500.14.1"}, {"coremlc-version", "3500.32.1"}, {"coremltools-component-torch", "2.8.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "8.3.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 3, 224, 224]> image) {
            tensor<fp32, []> image__scaled___y_0 = const()[name = tensor<string, []>("image__scaled___y_0"), val = tensor<fp32, []>(0x1.010102p-8)];
            tensor<fp32, [1, 3, 224, 224]> image__scaled__ = mul(x = image, y = image__scaled___y_0)[name = tensor<string, []>("image__scaled__")];
            tensor<int32, []> var_15 = const()[name = tensor<string, []>("op_15"), val = tensor<int32, []>(1)];
            tensor<string, []> patch_embeds_1_pad_type_0 = const()[name = tensor<string, []>("patch_embeds_1_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> patch_embeds_1_strides_0 = const()[name = tensor<string, []>("patch_embeds_1_strides_0"), val = tensor<int32, [2]>([16, 16])];
            tensor<int32, [4]> patch_embeds_1_pad_0 = const()[name = tensor<string, []>("patch_embeds_1_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> patch_embeds_1_dilations_0 = const()[name = tensor<string, []>("patch_embeds_1_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> patch_embeds_1_groups_0 = const()[name = tensor<string, []>("patch_embeds_1_groups_0"), val = tensor<int32, []>(1)];
            tensor<string, []> image_to_fp16_dtype_0 = const()[name = tensor<string, []>("image_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [256, 3, 16, 16]> vision_model_embeddings_patch_embedding_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_embeddings_patch_embedding_weight_to_fp16"), val = tensor<fp16, [256, 3, 16, 16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [1, 3, 224, 224]> image_to_fp16 = cast(dtype = image_to_fp16_dtype_0, x = image__scaled__)[name = tensor<string, []>("cast_46")];
            tensor<fp16, [1, 256, 14, 14]> patch_embeds_1_cast_fp16 = conv(dilations = patch_embeds_1_dilations_0, groups = patch_embeds_1_groups_0, pad = patch_embeds_1_pad_0, pad_type = patch_embeds_1_pad_type_0, strides = patch_embeds_1_strides_0, weight = vision_model_embeddings_patch_embedding_weight_to_fp16, x = image_to_fp16)[name = tensor<string, []>("patch_embeds_1_cast_fp16")];
            tensor<int32, [3]> concat_0 = const()[name = tensor<string, []>("concat_0"), val = tensor<int32, [3]>([1, 256, 196])];
            tensor<fp16, [1, 256, 196]> var_35_cast_fp16 = reshape(shape = concat_0, x = patch_embeds_1_cast_fp16)[name = tensor<string, []>("op_35_cast_fp16")];
            tensor<int32, [3]> patch_embeds_perm_0 = const()[name = tensor<string, []>("patch_embeds_perm_0"), val = tensor<int32, [3]>([0, 2, 1])];
            tensor<bool, []> embeddings_1_interleave_0 = const()[name = tensor<string, []>("embeddings_1_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 1, 256]> expand_dims_0_to_fp16 = const()[name = tensor<string, []>("expand_dims_0_to_fp16"), val = tensor<fp16, [1, 1, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(393344)))];
            tensor<fp16, [1, 196, 256]> patch_embeds_cast_fp16 = transpose(perm = patch_embeds_perm_0, x = var_35_cast_fp16)[name = tensor<string, []>("transpose_100")];
            tensor<fp16, [1, 197, 256]> embeddings_1_cast_fp16 = concat(axis = var_15, interleave = embeddings_1_interleave_0, values = (expand_dims_0_to_fp16, patch_embeds_cast_fp16))[name = tensor<string, []>("embeddings_1_cast_fp16")];
            tensor<fp16, [1, 197, 256]> var_42_to_fp16 = const()[name = tensor<string, []>("op_42_to_fp16"), val = tensor<fp16, [1, 197, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(393920)))];
            tensor<fp16, [1, 197, 256]> input_5_cast_fp16 = add(x = embeddings_1_cast_fp16, y = var_42_to_fp16)[name = tensor<string, []>("input_5_cast_fp16")];
            tensor<int32, [1]> input_7_axes_0 = const()[name = tensor<string, []>("input_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> vision_model_pre_layrnorm_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_pre_layrnorm_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(494848)))];
            tensor<fp16, [256]> vision_model_pre_layrnorm_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_pre_layrnorm_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(495424)))];
            tensor<fp16, []> var_9_to_fp16 = const()[name = tensor<string, []>("op_9_to_fp16"), val = tensor<fp16, []>(0x1.5p-17)];
            tensor<fp16, [1, 197, 256]> input_7_cast_fp16 = layer_norm(axes = input_7_axes_0, beta = vision_model_pre_layrnorm_bias_to_fp16, epsilon = var_9_to_fp16, gamma = vision_model_pre_layrnorm_weight_to_fp16, x = input_5_cast_fp16)[name = tensor<string, []>("input_7_cast_fp16")];
            tensor<int32, [1]> hidden_states_1_axes_0 = const()[name = tensor<string, []>("hidden_states_1_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> vision_model_encoder_layers_0_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_layer_norm1_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(496000)))];
            tensor<fp16, [256]> vision_model_encoder_layers_0_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_layer_norm1_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(496576)))];
            tensor<fp16, [1, 197, 256]> hidden_states_1_cast_fp16 = layer_norm(axes = hidden_states_1_axes_0, beta = vision_model_encoder_layers_0_layer_norm1_bias_to_fp16, epsilon = var_9_to_fp16, gamma = vision_model_encoder_layers_0_layer_norm1_weight_to_fp16, x = input_7_cast_fp16)[name = tensor<string, []>("hidden_states_1_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(497152)))];
            tensor<fp16, [256]> vision_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(628288)))];
            tensor<fp16, [1, 197, 256]> linear_0_cast_fp16 = linear(bias = vision_model_encoder_layers_0_self_attn_q_proj_bias_to_fp16, weight = vision_model_encoder_layers_0_self_attn_q_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_0_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(628864)))];
            tensor<fp16, [256]> vision_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(760000)))];
            tensor<fp16, [1, 197, 256]> linear_1_cast_fp16 = linear(bias = vision_model_encoder_layers_0_self_attn_k_proj_bias_to_fp16, weight = vision_model_encoder_layers_0_self_attn_k_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_1_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(760576)))];
            tensor<fp16, [256]> vision_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(891712)))];
            tensor<fp16, [1, 197, 256]> linear_2_cast_fp16 = linear(bias = vision_model_encoder_layers_0_self_attn_v_proj_bias_to_fp16, weight = vision_model_encoder_layers_0_self_attn_v_proj_weight_to_fp16, x = hidden_states_1_cast_fp16)[name = tensor<string, []>("linear_2_cast_fp16")];
            tensor<int32, [4]> var_92 = const()[name = tensor<string, []>("op_92"), val = tensor<int32, [4]>([1, 197, -1, 64])];
            tensor<fp16, [1, 197, 4, 64]> var_93_cast_fp16 = reshape(shape = var_92, x = linear_0_cast_fp16)[name = tensor<string, []>("op_93_cast_fp16")];
            tensor<int32, [4]> var_95 = const()[name = tensor<string, []>("op_95"), val = tensor<int32, [4]>([1, 197, -1, 64])];
            tensor<fp16, [1, 197, 4, 64]> var_96_cast_fp16 = reshape(shape = var_95, x = linear_1_cast_fp16)[name = tensor<string, []>("op_96_cast_fp16")];
            tensor<int32, [4]> var_98 = const()[name = tensor<string, []>("op_98"), val = tensor<int32, [4]>([1, 197, -1, 64])];
            tensor<fp16, [1, 197, 4, 64]> var_99_cast_fp16 = reshape(shape = var_98, x = linear_2_cast_fp16)[name = tensor<string, []>("op_99_cast_fp16")];
            tensor<int32, [4]> value_1_perm_0 = const()[name = tensor<string, []>("value_1_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, []> var_7_to_fp16 = const()[name = tensor<string, []>("op_7_to_fp16"), val = tensor<fp16, []>(0x1p-3)];
            tensor<fp16, [1, 197, 4, 64]> mul_0_cast_fp16 = mul(x = var_93_cast_fp16, y = var_7_to_fp16)[name = tensor<string, []>("mul_0_cast_fp16")];
            tensor<bool, []> matmul_0_transpose_y_0 = const()[name = tensor<string, []>("matmul_0_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_0_transpose_x_0 = const()[name = tensor<string, []>("matmul_0_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_40_perm_0 = const()[name = tensor<string, []>("transpose_40_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_41_perm_0 = const()[name = tensor<string, []>("transpose_41_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 4, 197, 64]> transpose_41 = transpose(perm = transpose_41_perm_0, x = var_96_cast_fp16)[name = tensor<string, []>("transpose_97")];
            tensor<fp16, [1, 4, 197, 64]> transpose_40 = transpose(perm = transpose_40_perm_0, x = mul_0_cast_fp16)[name = tensor<string, []>("transpose_98")];
            tensor<fp16, [1, 4, 197, 197]> matmul_0_cast_fp16 = matmul(transpose_x = matmul_0_transpose_x_0, transpose_y = matmul_0_transpose_y_0, x = transpose_40, y = transpose_41)[name = tensor<string, []>("matmul_0_cast_fp16")];
            tensor<int32, []> softmax_0_axis_0 = const()[name = tensor<string, []>("softmax_0_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 197, 197]> softmax_0_cast_fp16 = softmax(axis = softmax_0_axis_0, x = matmul_0_cast_fp16)[name = tensor<string, []>("softmax_0_cast_fp16")];
            tensor<bool, []> attn_output_1_transpose_x_0 = const()[name = tensor<string, []>("attn_output_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_1_transpose_y_0 = const()[name = tensor<string, []>("attn_output_1_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 4, 197, 64]> value_1_cast_fp16 = transpose(perm = value_1_perm_0, x = var_99_cast_fp16)[name = tensor<string, []>("transpose_99")];
            tensor<fp16, [1, 4, 197, 64]> attn_output_1_cast_fp16 = matmul(transpose_x = attn_output_1_transpose_x_0, transpose_y = attn_output_1_transpose_y_0, x = softmax_0_cast_fp16, y = value_1_cast_fp16)[name = tensor<string, []>("attn_output_1_cast_fp16")];
            tensor<int32, [4]> var_102_perm_0 = const()[name = tensor<string, []>("op_102_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_104 = const()[name = tensor<string, []>("op_104"), val = tensor<int32, [3]>([1, 197, 256])];
            tensor<fp16, [1, 197, 4, 64]> var_102_cast_fp16 = transpose(perm = var_102_perm_0, x = attn_output_1_cast_fp16)[name = tensor<string, []>("transpose_96")];
            tensor<fp16, [1, 197, 256]> var_105_cast_fp16 = reshape(shape = var_104, x = var_102_cast_fp16)[name = tensor<string, []>("op_105_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(892288)))];
            tensor<fp16, [256]> vision_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1023424)))];
            tensor<fp16, [1, 197, 256]> linear_3_cast_fp16 = linear(bias = vision_model_encoder_layers_0_self_attn_out_proj_bias_to_fp16, weight = vision_model_encoder_layers_0_self_attn_out_proj_weight_to_fp16, x = var_105_cast_fp16)[name = tensor<string, []>("linear_3_cast_fp16")];
            tensor<fp16, [1, 197, 256]> input_11_cast_fp16 = add(x = input_7_cast_fp16, y = linear_3_cast_fp16)[name = tensor<string, []>("input_11_cast_fp16")];
            tensor<int32, [1]> input_13_axes_0 = const()[name = tensor<string, []>("input_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> vision_model_encoder_layers_0_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_layer_norm2_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1024000)))];
            tensor<fp16, [256]> vision_model_encoder_layers_0_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_layer_norm2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1024576)))];
            tensor<fp16, [1, 197, 256]> input_13_cast_fp16 = layer_norm(axes = input_13_axes_0, beta = vision_model_encoder_layers_0_layer_norm2_bias_to_fp16, epsilon = var_9_to_fp16, gamma = vision_model_encoder_layers_0_layer_norm2_weight_to_fp16, x = input_11_cast_fp16)[name = tensor<string, []>("input_13_cast_fp16")];
            tensor<fp16, [1024, 256]> vision_model_encoder_layers_0_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1024, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1025152)))];
            tensor<fp16, [1024]> vision_model_encoder_layers_0_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1549504)))];
            tensor<fp16, [1, 197, 1024]> linear_4_cast_fp16 = linear(bias = vision_model_encoder_layers_0_mlp_fc1_bias_to_fp16, weight = vision_model_encoder_layers_0_mlp_fc1_weight_to_fp16, x = input_13_cast_fp16)[name = tensor<string, []>("linear_4_cast_fp16")];
            tensor<string, []> input_17_mode_0 = const()[name = tensor<string, []>("input_17_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 197, 1024]> input_17_cast_fp16 = gelu(mode = input_17_mode_0, x = linear_4_cast_fp16)[name = tensor<string, []>("input_17_cast_fp16")];
            tensor<fp16, [256, 1024]> vision_model_encoder_layers_0_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [256, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1551616)))];
            tensor<fp16, [256]> vision_model_encoder_layers_0_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_0_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2075968)))];
            tensor<fp16, [1, 197, 256]> linear_5_cast_fp16 = linear(bias = vision_model_encoder_layers_0_mlp_fc2_bias_to_fp16, weight = vision_model_encoder_layers_0_mlp_fc2_weight_to_fp16, x = input_17_cast_fp16)[name = tensor<string, []>("linear_5_cast_fp16")];
            tensor<fp16, [1, 197, 256]> input_19_cast_fp16 = add(x = input_11_cast_fp16, y = linear_5_cast_fp16)[name = tensor<string, []>("input_19_cast_fp16")];
            tensor<int32, [1]> hidden_states_7_axes_0 = const()[name = tensor<string, []>("hidden_states_7_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> vision_model_encoder_layers_1_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_layer_norm1_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2076544)))];
            tensor<fp16, [256]> vision_model_encoder_layers_1_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_layer_norm1_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2077120)))];
            tensor<fp16, [1, 197, 256]> hidden_states_7_cast_fp16 = layer_norm(axes = hidden_states_7_axes_0, beta = vision_model_encoder_layers_1_layer_norm1_bias_to_fp16, epsilon = var_9_to_fp16, gamma = vision_model_encoder_layers_1_layer_norm1_weight_to_fp16, x = input_19_cast_fp16)[name = tensor<string, []>("hidden_states_7_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2077696)))];
            tensor<fp16, [256]> vision_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2208832)))];
            tensor<fp16, [1, 197, 256]> linear_6_cast_fp16 = linear(bias = vision_model_encoder_layers_1_self_attn_q_proj_bias_to_fp16, weight = vision_model_encoder_layers_1_self_attn_q_proj_weight_to_fp16, x = hidden_states_7_cast_fp16)[name = tensor<string, []>("linear_6_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2209408)))];
            tensor<fp16, [256]> vision_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2340544)))];
            tensor<fp16, [1, 197, 256]> linear_7_cast_fp16 = linear(bias = vision_model_encoder_layers_1_self_attn_k_proj_bias_to_fp16, weight = vision_model_encoder_layers_1_self_attn_k_proj_weight_to_fp16, x = hidden_states_7_cast_fp16)[name = tensor<string, []>("linear_7_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2341120)))];
            tensor<fp16, [256]> vision_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2472256)))];
            tensor<fp16, [1, 197, 256]> linear_8_cast_fp16 = linear(bias = vision_model_encoder_layers_1_self_attn_v_proj_bias_to_fp16, weight = vision_model_encoder_layers_1_self_attn_v_proj_weight_to_fp16, x = hidden_states_7_cast_fp16)[name = tensor<string, []>("linear_8_cast_fp16")];
            tensor<int32, [4]> var_149 = const()[name = tensor<string, []>("op_149"), val = tensor<int32, [4]>([1, 197, -1, 64])];
            tensor<fp16, [1, 197, 4, 64]> var_150_cast_fp16 = reshape(shape = var_149, x = linear_6_cast_fp16)[name = tensor<string, []>("op_150_cast_fp16")];
            tensor<int32, [4]> var_152 = const()[name = tensor<string, []>("op_152"), val = tensor<int32, [4]>([1, 197, -1, 64])];
            tensor<fp16, [1, 197, 4, 64]> var_153_cast_fp16 = reshape(shape = var_152, x = linear_7_cast_fp16)[name = tensor<string, []>("op_153_cast_fp16")];
            tensor<int32, [4]> var_155 = const()[name = tensor<string, []>("op_155"), val = tensor<int32, [4]>([1, 197, -1, 64])];
            tensor<fp16, [1, 197, 4, 64]> var_156_cast_fp16 = reshape(shape = var_155, x = linear_8_cast_fp16)[name = tensor<string, []>("op_156_cast_fp16")];
            tensor<int32, [4]> value_3_perm_0 = const()[name = tensor<string, []>("value_3_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1, 197, 4, 64]> mul_1_cast_fp16 = mul(x = var_150_cast_fp16, y = var_7_to_fp16)[name = tensor<string, []>("mul_1_cast_fp16")];
            tensor<bool, []> matmul_1_transpose_y_0 = const()[name = tensor<string, []>("matmul_1_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_1_transpose_x_0 = const()[name = tensor<string, []>("matmul_1_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_42_perm_0 = const()[name = tensor<string, []>("transpose_42_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_43_perm_0 = const()[name = tensor<string, []>("transpose_43_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 4, 197, 64]> transpose_43 = transpose(perm = transpose_43_perm_0, x = var_153_cast_fp16)[name = tensor<string, []>("transpose_93")];
            tensor<fp16, [1, 4, 197, 64]> transpose_42 = transpose(perm = transpose_42_perm_0, x = mul_1_cast_fp16)[name = tensor<string, []>("transpose_94")];
            tensor<fp16, [1, 4, 197, 197]> matmul_1_cast_fp16 = matmul(transpose_x = matmul_1_transpose_x_0, transpose_y = matmul_1_transpose_y_0, x = transpose_42, y = transpose_43)[name = tensor<string, []>("matmul_1_cast_fp16")];
            tensor<int32, []> softmax_1_axis_0 = const()[name = tensor<string, []>("softmax_1_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 197, 197]> softmax_1_cast_fp16 = softmax(axis = softmax_1_axis_0, x = matmul_1_cast_fp16)[name = tensor<string, []>("softmax_1_cast_fp16")];
            tensor<bool, []> attn_output_5_transpose_x_0 = const()[name = tensor<string, []>("attn_output_5_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_5_transpose_y_0 = const()[name = tensor<string, []>("attn_output_5_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 4, 197, 64]> value_3_cast_fp16 = transpose(perm = value_3_perm_0, x = var_156_cast_fp16)[name = tensor<string, []>("transpose_95")];
            tensor<fp16, [1, 4, 197, 64]> attn_output_5_cast_fp16 = matmul(transpose_x = attn_output_5_transpose_x_0, transpose_y = attn_output_5_transpose_y_0, x = softmax_1_cast_fp16, y = value_3_cast_fp16)[name = tensor<string, []>("attn_output_5_cast_fp16")];
            tensor<int32, [4]> var_159_perm_0 = const()[name = tensor<string, []>("op_159_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_161 = const()[name = tensor<string, []>("op_161"), val = tensor<int32, [3]>([1, 197, 256])];
            tensor<fp16, [1, 197, 4, 64]> var_159_cast_fp16 = transpose(perm = var_159_perm_0, x = attn_output_5_cast_fp16)[name = tensor<string, []>("transpose_92")];
            tensor<fp16, [1, 197, 256]> var_162_cast_fp16 = reshape(shape = var_161, x = var_159_cast_fp16)[name = tensor<string, []>("op_162_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2472832)))];
            tensor<fp16, [256]> vision_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2603968)))];
            tensor<fp16, [1, 197, 256]> linear_9_cast_fp16 = linear(bias = vision_model_encoder_layers_1_self_attn_out_proj_bias_to_fp16, weight = vision_model_encoder_layers_1_self_attn_out_proj_weight_to_fp16, x = var_162_cast_fp16)[name = tensor<string, []>("linear_9_cast_fp16")];
            tensor<fp16, [1, 197, 256]> input_23_cast_fp16 = add(x = input_19_cast_fp16, y = linear_9_cast_fp16)[name = tensor<string, []>("input_23_cast_fp16")];
            tensor<int32, [1]> input_25_axes_0 = const()[name = tensor<string, []>("input_25_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> vision_model_encoder_layers_1_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_layer_norm2_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2604544)))];
            tensor<fp16, [256]> vision_model_encoder_layers_1_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_layer_norm2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2605120)))];
            tensor<fp16, [1, 197, 256]> input_25_cast_fp16 = layer_norm(axes = input_25_axes_0, beta = vision_model_encoder_layers_1_layer_norm2_bias_to_fp16, epsilon = var_9_to_fp16, gamma = vision_model_encoder_layers_1_layer_norm2_weight_to_fp16, x = input_23_cast_fp16)[name = tensor<string, []>("input_25_cast_fp16")];
            tensor<fp16, [1024, 256]> vision_model_encoder_layers_1_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1024, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(2605696)))];
            tensor<fp16, [1024]> vision_model_encoder_layers_1_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3130048)))];
            tensor<fp16, [1, 197, 1024]> linear_10_cast_fp16 = linear(bias = vision_model_encoder_layers_1_mlp_fc1_bias_to_fp16, weight = vision_model_encoder_layers_1_mlp_fc1_weight_to_fp16, x = input_25_cast_fp16)[name = tensor<string, []>("linear_10_cast_fp16")];
            tensor<string, []> input_29_mode_0 = const()[name = tensor<string, []>("input_29_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 197, 1024]> input_29_cast_fp16 = gelu(mode = input_29_mode_0, x = linear_10_cast_fp16)[name = tensor<string, []>("input_29_cast_fp16")];
            tensor<fp16, [256, 1024]> vision_model_encoder_layers_1_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [256, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3132160)))];
            tensor<fp16, [256]> vision_model_encoder_layers_1_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_1_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3656512)))];
            tensor<fp16, [1, 197, 256]> linear_11_cast_fp16 = linear(bias = vision_model_encoder_layers_1_mlp_fc2_bias_to_fp16, weight = vision_model_encoder_layers_1_mlp_fc2_weight_to_fp16, x = input_29_cast_fp16)[name = tensor<string, []>("linear_11_cast_fp16")];
            tensor<fp16, [1, 197, 256]> input_31_cast_fp16 = add(x = input_23_cast_fp16, y = linear_11_cast_fp16)[name = tensor<string, []>("input_31_cast_fp16")];
            tensor<int32, [1]> hidden_states_13_axes_0 = const()[name = tensor<string, []>("hidden_states_13_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> vision_model_encoder_layers_2_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_layer_norm1_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3657088)))];
            tensor<fp16, [256]> vision_model_encoder_layers_2_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_layer_norm1_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3657664)))];
            tensor<fp16, [1, 197, 256]> hidden_states_13_cast_fp16 = layer_norm(axes = hidden_states_13_axes_0, beta = vision_model_encoder_layers_2_layer_norm1_bias_to_fp16, epsilon = var_9_to_fp16, gamma = vision_model_encoder_layers_2_layer_norm1_weight_to_fp16, x = input_31_cast_fp16)[name = tensor<string, []>("hidden_states_13_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3658240)))];
            tensor<fp16, [256]> vision_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3789376)))];
            tensor<fp16, [1, 197, 256]> linear_12_cast_fp16 = linear(bias = vision_model_encoder_layers_2_self_attn_q_proj_bias_to_fp16, weight = vision_model_encoder_layers_2_self_attn_q_proj_weight_to_fp16, x = hidden_states_13_cast_fp16)[name = tensor<string, []>("linear_12_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3789952)))];
            tensor<fp16, [256]> vision_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3921088)))];
            tensor<fp16, [1, 197, 256]> linear_13_cast_fp16 = linear(bias = vision_model_encoder_layers_2_self_attn_k_proj_bias_to_fp16, weight = vision_model_encoder_layers_2_self_attn_k_proj_weight_to_fp16, x = hidden_states_13_cast_fp16)[name = tensor<string, []>("linear_13_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3921664)))];
            tensor<fp16, [256]> vision_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4052800)))];
            tensor<fp16, [1, 197, 256]> linear_14_cast_fp16 = linear(bias = vision_model_encoder_layers_2_self_attn_v_proj_bias_to_fp16, weight = vision_model_encoder_layers_2_self_attn_v_proj_weight_to_fp16, x = hidden_states_13_cast_fp16)[name = tensor<string, []>("linear_14_cast_fp16")];
            tensor<int32, [4]> var_206 = const()[name = tensor<string, []>("op_206"), val = tensor<int32, [4]>([1, 197, -1, 64])];
            tensor<fp16, [1, 197, 4, 64]> var_207_cast_fp16 = reshape(shape = var_206, x = linear_12_cast_fp16)[name = tensor<string, []>("op_207_cast_fp16")];
            tensor<int32, [4]> var_209 = const()[name = tensor<string, []>("op_209"), val = tensor<int32, [4]>([1, 197, -1, 64])];
            tensor<fp16, [1, 197, 4, 64]> var_210_cast_fp16 = reshape(shape = var_209, x = linear_13_cast_fp16)[name = tensor<string, []>("op_210_cast_fp16")];
            tensor<int32, [4]> var_212 = const()[name = tensor<string, []>("op_212"), val = tensor<int32, [4]>([1, 197, -1, 64])];
            tensor<fp16, [1, 197, 4, 64]> var_213_cast_fp16 = reshape(shape = var_212, x = linear_14_cast_fp16)[name = tensor<string, []>("op_213_cast_fp16")];
            tensor<int32, [4]> value_5_perm_0 = const()[name = tensor<string, []>("value_5_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1, 197, 4, 64]> mul_2_cast_fp16 = mul(x = var_207_cast_fp16, y = var_7_to_fp16)[name = tensor<string, []>("mul_2_cast_fp16")];
            tensor<bool, []> matmul_2_transpose_y_0 = const()[name = tensor<string, []>("matmul_2_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_2_transpose_x_0 = const()[name = tensor<string, []>("matmul_2_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_44_perm_0 = const()[name = tensor<string, []>("transpose_44_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_45_perm_0 = const()[name = tensor<string, []>("transpose_45_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 4, 197, 64]> transpose_45 = transpose(perm = transpose_45_perm_0, x = var_210_cast_fp16)[name = tensor<string, []>("transpose_89")];
            tensor<fp16, [1, 4, 197, 64]> transpose_44 = transpose(perm = transpose_44_perm_0, x = mul_2_cast_fp16)[name = tensor<string, []>("transpose_90")];
            tensor<fp16, [1, 4, 197, 197]> matmul_2_cast_fp16 = matmul(transpose_x = matmul_2_transpose_x_0, transpose_y = matmul_2_transpose_y_0, x = transpose_44, y = transpose_45)[name = tensor<string, []>("matmul_2_cast_fp16")];
            tensor<int32, []> softmax_2_axis_0 = const()[name = tensor<string, []>("softmax_2_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 197, 197]> softmax_2_cast_fp16 = softmax(axis = softmax_2_axis_0, x = matmul_2_cast_fp16)[name = tensor<string, []>("softmax_2_cast_fp16")];
            tensor<bool, []> attn_output_9_transpose_x_0 = const()[name = tensor<string, []>("attn_output_9_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_9_transpose_y_0 = const()[name = tensor<string, []>("attn_output_9_transpose_y_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 4, 197, 64]> value_5_cast_fp16 = transpose(perm = value_5_perm_0, x = var_213_cast_fp16)[name = tensor<string, []>("transpose_91")];
            tensor<fp16, [1, 4, 197, 64]> attn_output_9_cast_fp16 = matmul(transpose_x = attn_output_9_transpose_x_0, transpose_y = attn_output_9_transpose_y_0, x = softmax_2_cast_fp16, y = value_5_cast_fp16)[name = tensor<string, []>("attn_output_9_cast_fp16")];
            tensor<int32, [4]> var_216_perm_0 = const()[name = tensor<string, []>("op_216_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<int32, [3]> var_218 = const()[name = tensor<string, []>("op_218"), val = tensor<int32, [3]>([1, 197, 256])];
            tensor<fp16, [1, 197, 4, 64]> var_216_cast_fp16 = transpose(perm = var_216_perm_0, x = attn_output_9_cast_fp16)[name = tensor<string, []>("transpose_88")];
            tensor<fp16, [1, 197, 256]> var_219_cast_fp16 = reshape(shape = var_218, x = var_216_cast_fp16)[name = tensor<string, []>("op_219_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4053376)))];
            tensor<fp16, [256]> vision_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4184512)))];
            tensor<fp16, [1, 197, 256]> linear_15_cast_fp16 = linear(bias = vision_model_encoder_layers_2_self_attn_out_proj_bias_to_fp16, weight = vision_model_encoder_layers_2_self_attn_out_proj_weight_to_fp16, x = var_219_cast_fp16)[name = tensor<string, []>("linear_15_cast_fp16")];
            tensor<fp16, [1, 197, 256]> input_35_cast_fp16 = add(x = input_31_cast_fp16, y = linear_15_cast_fp16)[name = tensor<string, []>("input_35_cast_fp16")];
            tensor<int32, [1]> input_37_axes_0 = const()[name = tensor<string, []>("input_37_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> vision_model_encoder_layers_2_layer_norm2_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_layer_norm2_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4185088)))];
            tensor<fp16, [256]> vision_model_encoder_layers_2_layer_norm2_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_layer_norm2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4185664)))];
            tensor<fp16, [1, 197, 256]> input_37_cast_fp16 = layer_norm(axes = input_37_axes_0, beta = vision_model_encoder_layers_2_layer_norm2_bias_to_fp16, epsilon = var_9_to_fp16, gamma = vision_model_encoder_layers_2_layer_norm2_weight_to_fp16, x = input_35_cast_fp16)[name = tensor<string, []>("input_37_cast_fp16")];
            tensor<fp16, [1024, 256]> vision_model_encoder_layers_2_mlp_fc1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_mlp_fc1_weight_to_fp16"), val = tensor<fp16, [1024, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4186240)))];
            tensor<fp16, [1024]> vision_model_encoder_layers_2_mlp_fc1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_mlp_fc1_bias_to_fp16"), val = tensor<fp16, [1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4710592)))];
            tensor<fp16, [1, 197, 1024]> linear_16_cast_fp16 = linear(bias = vision_model_encoder_layers_2_mlp_fc1_bias_to_fp16, weight = vision_model_encoder_layers_2_mlp_fc1_weight_to_fp16, x = input_37_cast_fp16)[name = tensor<string, []>("linear_16_cast_fp16")];
            tensor<string, []> input_41_mode_0 = const()[name = tensor<string, []>("input_41_mode_0"), val = tensor<string, []>("EXACT")];
            tensor<fp16, [1, 197, 1024]> input_41_cast_fp16 = gelu(mode = input_41_mode_0, x = linear_16_cast_fp16)[name = tensor<string, []>("input_41_cast_fp16")];
            tensor<fp16, [256, 1024]> vision_model_encoder_layers_2_mlp_fc2_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_mlp_fc2_weight_to_fp16"), val = tensor<fp16, [256, 1024]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(4712704)))];
            tensor<fp16, [256]> vision_model_encoder_layers_2_mlp_fc2_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_2_mlp_fc2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5237056)))];
            tensor<fp16, [1, 197, 256]> linear_17_cast_fp16 = linear(bias = vision_model_encoder_layers_2_mlp_fc2_bias_to_fp16, weight = vision_model_encoder_layers_2_mlp_fc2_weight_to_fp16, x = input_41_cast_fp16)[name = tensor<string, []>("linear_17_cast_fp16")];
            tensor<fp16, [1, 197, 256]> input_43_cast_fp16 = add(x = input_35_cast_fp16, y = linear_17_cast_fp16)[name = tensor<string, []>("input_43_cast_fp16")];
            tensor<int32, [1]> hidden_states_19_axes_0 = const()[name = tensor<string, []>("hidden_states_19_axes_0"), val = tensor<int32, [1]>([-1])];
            tensor<fp16, [256]> vision_model_encoder_layers_3_layer_norm1_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_3_layer_norm1_weight_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5237632)))];
            tensor<fp16, [256]> vision_model_encoder_layers_3_layer_norm1_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_3_layer_norm1_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5238208)))];
            tensor<fp16, [1, 197, 256]> hidden_states_19_cast_fp16 = layer_norm(axes = hidden_states_19_axes_0, beta = vision_model_encoder_layers_3_layer_norm1_bias_to_fp16, epsilon = var_9_to_fp16, gamma = vision_model_encoder_layers_3_layer_norm1_weight_to_fp16, x = input_43_cast_fp16)[name = tensor<string, []>("hidden_states_19_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5238784)))];
            tensor<fp16, [256]> vision_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5369920)))];
            tensor<fp16, [1, 197, 256]> linear_18_cast_fp16 = linear(bias = vision_model_encoder_layers_3_self_attn_q_proj_bias_to_fp16, weight = vision_model_encoder_layers_3_self_attn_q_proj_weight_to_fp16, x = hidden_states_19_cast_fp16)[name = tensor<string, []>("linear_18_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5370496)))];
            tensor<fp16, [256]> vision_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5501632)))];
            tensor<fp16, [1, 197, 256]> linear_19_cast_fp16 = linear(bias = vision_model_encoder_layers_3_self_attn_k_proj_bias_to_fp16, weight = vision_model_encoder_layers_3_self_attn_k_proj_weight_to_fp16, x = hidden_states_19_cast_fp16)[name = tensor<string, []>("linear_19_cast_fp16")];
            tensor<fp16, [256, 256]> vision_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16"), val = tensor<fp16, [256, 256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5502208)))];
            tensor<fp16, [256]> vision_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16 = const()[name = tensor<string, []>("vision_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(5633344)))];
            tensor<fp16, [1, 197, 256]> linear_20_cast_fp16 = linear(bias = vision_model_encoder_layers_3_self_attn_v_proj_bias_to_fp16, weight = vision_model_encoder_layers_3_self_attn_v_proj_weight_to_fp16, x = hidden_states_19_cast_fp16)[name = tensor<string, []>("linear_20_cast_fp16")];
            tensor<int32, [4]> var_263 = const()[name = tensor<string, []>("op_263"), val = tensor<int32, [4]>([1, 197, -1, 64])];
            tensor<fp16, [1, 197, 4, 64]> var_264_cast_fp16 = reshape(shape = var_263, x = linear_18_cast_fp16)[name = tensor<string, []>("op_264_cast_fp16")];
            tensor<int32, [4]> var_266 = const()[name = tensor<string, []>("op_266"), val = tensor<int32, [4]>([1, 197, -1, 64])];
            tensor<fp16, [1, 197, 4, 64]> var_267_cast_fp16 = reshape(shape = var_266, x = linear_19_cast_fp16)[name = tensor<string, []>("op_267_cast_fp16")];
            tensor<int32, [4]> var_269 = const()[name = tensor<string, []>("op_269"), val = tensor<int32, [4]>([1, 197, -1, 64])];
            tensor<fp16, [1, 197, 4, 64]> var_270_cast_fp16 = reshape(shape = var_269, x = linear_20_cast_fp16)[name = tensor<string, []>("op_270_cast_fp16")];
            tensor<int32, [4]> value_7_perm_0 = const()[name = tensor<string, []>("value_7_perm_0"), val = tensor<int32, [4]>([0, 2, 1, 3])];
            tensor<fp16, [1, 197, 4, 64]> mul_3_cast_fp16 = mul(x = var_264_cast_fp16, y = var_7_to_fp16)[name = tensor<string, []>("mul_3_cast_fp16")];
            tensor<bool, []> matmul_3_transpose_y_0 = const()[name = tensor<string, []>("matmul_3_transpose_y_0"), val = tensor<bool, []>(true)];
            tensor<bool, []> matmul_3_transpose_x_0 = const()[name = tensor<string, []>("matmul_3_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<int32, [4]> transpose_46_perm_0 = const()[name = tensor<string, []>("transpose_46_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<int32, [4]> transpose_47_perm_0 = const()[name = tensor<string, []>("transpose_47_perm_0"), val = tensor<int32, [4]>([0, 2, -3, -1])];
            tensor<fp16, [1, 4, 197, 64]> transpose_47 = transpose(perm = transpose_47_perm_0, x = var_267_cast_fp16)[name = tensor<string, []>("transpose_85")];
            tensor<fp16, [1, 4, 197, 64]> transpose_46 = transpose(perm = transpose_46_perm_0, x = mul_3_cast_fp16)[name = tensor<string, []>("transpose_86")];
            tensor<fp16, [1, 4, 197, 197]> matmul_3_cast_fp16 = matmul(transpose_x = matmul_3_transpose_x_0, transpose_y = matmul_3_transpose_y_0, x = transpose_46, y = transpose_47)[name = tensor<string, []>("matmul_3_cast_fp16")];
            tensor<int32, []> softmax_3_axis_0 = const()[name = tensor<string, []>("softmax_3_axis_0"), val = tensor<int32, []>(-1)];
            tensor<fp16, [1, 4, 197, 197]> softmax_3_cast_fp16 = softmax(axis = softmax_3_axis_0, x = matmul_3_cast_fp16)[name = tensor<string, []>("softmax_3_cast_fp16")];
            tensor<bool, []> attn_output_13_transpose_x_0 = const()[name = tensor<string, []>("attn_output_13_transpose_x_0"), val = tensor<bool, []>(false)];
            tensor<bool, []> attn_output_13_transpose_y_0 = const()[name = tensor<string, []>("attn_output_13_transpose_y_0"), val = tensor<bool, []>(false)];
